online_benchmark_log/mi35x/GROK1/v0.5.4.post2-rocm700-mi35x-20251103_GROK1_MOE-I4F8_online/sglang_client_log_GROK1_aiter_1_run1_20251103_155202.log
Running benchmark with request rate: 1 (Run 1) for mode aiter
Run started at: 2025-11-03 15:52:02 PST
Executing: python3 -m sglang.bench_serving --backend sglang --tokenizer "/data/amd--grok-1-W4A8KV8" --dataset-name random --random-input 1024 --random-output 1024 --num-prompts 300 --request-rate 1
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='/data/amd--grok-1-W4A8KV8', served_model_name=None, tokenizer='/data/amd--grok-1-W4A8KV8', num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 152612
#Output tokens: 160347
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 300/300 [05:24<00:00,  1.08s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     300       
Benchmark duration (s):                  324.39    
Total input tokens:                      152612    
Total input text tokens:                 152612    
Total input vision tokens:               0         
Total generated tokens:                  160347    
Total generated tokens (retokenized):    163558    
Request throughput (req/s):              0.92      
Input token throughput (tok/s):          470.46    
Output token throughput (tok/s):         494.30    
Total token throughput (tok/s):          964.76    
Concurrency:                             26.83     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   29010.92  
Median E2E Latency (ms):                 29624.69  
---------------Time to First Token----------------
Mean TTFT (ms):                          237.01    
Median TTFT (ms):                        215.02    
P99 TTFT (ms):                           994.06    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           53.94     
Median ITL (ms):                         42.24     
P95 ITL (ms):                            93.06     
P99 ITL (ms):                            245.15    
Max ITL (ms):                            999.06    
==================================================
Run completed at: 2025-11-03 15:57:36 PST
Run duration: 334 seconds
----------------------------------------